Revit 2027 API
IdlingEventArgs Properties
The IdlingEventArgs type exposes the following members.
Properties
Name | Description
Cancellable |  Indicates whether an event may be cancelled by an event delegate.
(Inherited from RevitAPIEventArgs)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from RevitAPIEventArgs)
Top
See Also
Reference
IdlingEventArgs Class
Autodesk.Revit.UI.Events Namespace